"""
TODO: EN doc
"""


def GenerateBBSTArray(a: list) -> list:
    """TODO: EN doc
    1. Выбираем центральный элемент исходного
       отсортированного массива, и делаем его корневым (на
       первом шаге помещаем его в нулевой элемент итогового
       массива).
    2. Для левой части по отношению к выбранному элементу
       повторяем этот алгоритм -- индекс корневого элемента
       левой части будет равен индексу левого наследника
       корня из пункта 1.
    3. Для правой части по отношению к выбранному элементу
       повторяем этот алгоритм -- индекс корневого элемента
       правой части будет равен индексу правого наследника
       корня из пункта 1.
    """
    assert a

    return []

